{
  "id": 1,
  "title": "Manual Capsule Filling Machine",
  "descriptions": [
    "Manual Capsule Filling Machines  or capsule filler machine is a compact & versatile model for the filling of hard gelatine capsules. Manual Capsule Filling Machine is used in pharmaceutical, cosmetic, food, veterinary, biotech & allied industry. We have two models for this machine. The first is the GMP model, entirely made from Stainless Steel. The other is the Standard model, made from stainless steel except for the machine base made from hard chrome plated materials.",
    "A robust and easy-to-use device made of premium stainless steel is the manual capsule filling machine. With 300 holes and 25 x 12 combinations, the machine is built of SS 304/316 and complies with GMP regulations. The machine can fill capsules ranging from size #00 to #5, thanks to its interchangeable parts and various machinery. The assembly has been done so that disassembly for cleaning purposes is simple. Despite being entirely manual, the machine requires highly trained workers to assemble its precisely machined components. This machine is widely used in research laboratories, R&D centers, pilot batch manufacturing, herbal and nutraceutical preparations, Unani and Ayurvedic medicines, etc.",
    "Manual Capsule Filling Machine is a simple & sturdy machine made from a high grade of Stainless Steel. The machine has 300 holes with 25 x 12 combinations made in SS 304/316 constructions, meeting GMP requirements. The machine can fill size #00 to #5 capsules with different machines and interchangeable parts. Assembly has been done in such a way that it can be easily dismantled for cleaning operations. Though all the processes are manual, the machine calls for precision machined components and assembled with highly skilled personnel. The machine has wide usage in R&D laboratories, Research Institutions, Herbal & Nutraceutical preparations, Unani & Ayurvedic medicines, Pilot batch productions, etc. We also provide Automatic Capsule Loader and Manual Capsule Loader as optional equipment and a Capsule Filler to speed up the production."
  ],
  "features_lists": [
    {
      "name": "key features of manual capsule filling machine",
      "list": [
        "Around 8000 capsules/hour can be manufactured with the help of manual capsule filling machine.",
        "The machine can handle various complex powders",
        "Different type of capsules can be handled with this machine",
        "The movement and bench top mounting is easier in the manual capsule filling machine",
        "Lodha Pharma offers capsule filling machine at highly competitive price",
        "The machine has an added advantage of being 100% disassembled",
        "The machine can be completely washed as per the GMP rules"
      ]
    },
    {
      "name": "models available in manual capsule filling machine",
      "list": [
        "GMP Model: Complete designed from Stainless Steel 304",
        "Standard Model: All contact parts designed from Stainless Steel 304 & Non – Contact parts designed from Mild Steel with Hard Chrome plating."
      ]
    },
    {
      "name": "Placing Capsules in the Manual Capsule Filler",
      "list": [
        "Put empty capsules in the loading tray and place it onto the machine",
        "Pull locking handle forward, push down the long lever to lift the caps of the capsule bodies",
        "Put the tray with caps aside",
        "Push the locking handle back and capsule bodies will come to the filling surface"
      ]
    },
    {
      "name": "Filling Powder in the Capsules",
      "list": [
        "Put powder tray to avoid spilling of the powder",
        "Pour the right quantity of powder and spread it. Bring down the tamper and lock it",
        "Turn the handle given above to compress the powder",
        "Bring up the tamper. Pour & spread the extra powder"
      ]
    },
    {
      "name": "Covering the Capsules",
      "list": [
        "Put the tray with caps to filler and bring down the locking plate.",
        "Lock the plate and turn the front knob to the right",
        "Push the long lever down to push capsule bodies into caps",
        "Open the locking plate lock, lift the locking plate and turn the front knob to the left",
        "Pull down the long lever and lift the tray with filled capsules",
        "Turn the tray to get filled capsules out of the tray"
      ]
    },
    {
      "name": "benefits of manual capsule filling machine",
      "list": [
        "Simplistic design",
        "Easy operation",
        "Precise filling",
        "Reduction in powder wastage",
        "Strong and highly durable",
        "Cost-effective"
      ]
    }
  ],
  "tables": [
    {
      "name": "Technical Specification of manaul capsule filling machine",
      "headers": ["Model", "BP-MCF-300"],
      "rows": [
        ["Production Output", "Up to 6000 capsules/hour"],
        [
          "Capsule Combinations",
          "Size 00, 0, 1, 2, 3, 4 and 5 (through different machines & parts)"
        ],
        ["Sequence of holes", "25 x 12 = 300"],
        ["Numbers of Loading Trays", "Three Loading Trays"],
        ["Overall Dimension", "405mm (L) x 300mm (W) x 455mm (H) approx."],
        ["Net Weight", "43 Kgs. approx."],
        ["Gross Weight", "50 Kgs. approx."]
      ]
    }
  ],
  "metadata": {
    "title": "Manual Capsule Filling Machine By Bharat Pharmatech",
    "description": "manual capsule filling machine by bharat pharmatech models 100, 200, 300",
    "keywords": "manual capsule filling machine, capsule filling machine, capsule filling machine with bharat pharmatech"
  },
  "slug": "/manual-capsule-filling-machine",
  "collection": 1,
  "price": {
    "mrp_price": 399,
    "discounted_price": 279
  },
  "ratings": {
    "rating_count": 10,
    "rating": 4.6
  },
  "imgs": [
    {
      "img_id": "Backgrounds/difference-between-tablets-and-capsules_yqvtos",
      "alt": "manual capsule filling machine with bharat pharmatech"
    },
    {
      "img_id": "Backgrounds/difference-between-tablets-and-capsules_yqvtos",
      "alt": "manual capsule filling machine with bharat pharmatech"
    },
    {
      "img_id": "Backgrounds/difference-between-tablets-and-capsules_yqvtos",
      "alt": "manual capsule filling machine with bharat pharmatech"
    },
    {
      "img_id": "Backgrounds/difference-between-tablets-and-capsules_yqvtos",
      "alt": "manual capsule filling machine with bharat pharmatech"
    }
  ]
}
